dibo1968/pfc_2phases_dspic33ak/pfc_2phases_dspic33ak.X/mcc_generated_files/pwm_hs/pwm.h
}  

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function disables ADC trigger 1 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator trigger compare register 
 * @return     none  
 */
inline static void PWM_Trigger1Disable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVTbits.ADTR1EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVTbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVTbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_2:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG2EVTbits.ADTR1EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG2EVTbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG2EVTbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_3:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG3EVTbits.ADTR1EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG3EVTbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG3EVTbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function enables ADC trigger 2 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @pre        Trigger value has to be set using \ref PWM_TriggerACompareValueSet, 
 *             \ref PWM_TriggerBCompareValueSet or \ref PWM_TriggerCCompareValueSet
 *             before calling this function.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator trigger compare register 
 * @return     none  
 */
inline static void PWM_Trigger2Enable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVTbits.ADTR2EN1 = 1;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVTbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVTbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_2:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG2EVTbits.ADTR2EN1 = 1;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG2EVTbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG2EVTbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_3:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG3EVTbits.ADTR2EN1 = 1;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG3EVTbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG3EVTbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

}  

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function disables ADC trigger 2 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator trigger compare register 
 * @return     none  
 */
inline static void PWM_Trigger2Disable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVTbits.ADTR2EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVTbits.ADTR2EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVTbits.ADTR2EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_2:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG2EVTbits.ADTR2EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG2EVTbits.ADTR2EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG2EVTbits.ADTR2EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_3:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG3EVTbits.ADTR2EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG3EVTbits.ADTR2EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG3EVTbits.ADTR2EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

