dibo1968/pfc_2phases_dspic33ak/pfc_2phases_dspic33ak.X/mcc_generated_files/pwm_hs/pwm.h
}


/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function clears the status of PWM latched fault mode for the PWM Generator 
 *             selected by the argument \ref PWM_GENERATOR.   
 * @param[in]  genNum - PWM generator number
 * @return     none  
 */
inline static void PWM_FaultModeLatchClear(enum PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                PG1FPCIbits.SWTERM = 1;
                break;   
        case PWM_GENERATOR_2: 
                PG2FPCIbits.SWTERM = 1;
                break;   
        case PWM_GENERATOR_3: 
                PG3FPCIbits.SWTERM = 1;
                break;   
        default:break;   
    }   
}

/**
 * @ingroup    pwmhsdriver
 * @brief      This function can be used to override default callback 
 *             \ref PWM_GeneratorEOCEventCallback and to define custom callback for 
 *             PWM EOCEvent event.
 * @param[in]  callback - Address of the callback function
 * @return     none  
 */
void PWM_GeneratorEOCEventCallbackRegister(void (*callback)(enum PWM_GENERATOR genNum));

/**
 * @ingroup    pwmhsdriver
 * @brief      This is the default callback with weak attribute. The user can 
 *             override and implement the default callback without weak attribute 
 *             or can register a custom callback function using PWM_EOCEventCallbackRegister.
 * @param[in]  genNum - PWM generator number
 * @return     none  
 */
void PWM_GeneratorEOCEventCallback(enum PWM_GENERATOR genNum);


/**
 * @ingroup    pwmhsdriver
 * @brief      This is a tasks function for PWM1
 * @param[in]  intGen - PWM generator number
 * @return     none  
 */
void PWM_GeneratorTasks(enum PWM_GENERATOR intGen);

/**
 * @ingroup    pwmhsdriver
 * @brief      This function call used only in polling mode, if commonEvent occured for PWM, 
 *             then calls the respective callback function
 * @param[in]  event - Common event instance           
 * @return     none
 */
void PWM_CommonEventTasks(enum PWM_COMMON_EVENT event);

#endif //PWM_H

